package com.nextcont.mobilization.model

data class Aka(val title: String, val answer: Pair<String, String>) {

    companion object {

        val test: List<Aka>
            get() = listOf(
                Aka("1.你觉得下面哪个缺点更糟糕", Pair("A. 没有同情心的", "B. 不讲道理的")),
                Aka("2.你一般跟什么样的人相处得更好一些", Pair("A. 富有想象力的人", "B. 现实的人")),
                Aka("3.当你有一项特殊的工作要做时，你喜欢", Pair("A. 事先做好规划", "B. 边干边想下一步")),
                Aka("4.你更倾向于：", Pair("A. 支持和运用已经建立起来的好方法", "B. 分析存在的问题并攻破未解决的问题")),
                Aka("5.在做一件很多人都在做的工作时，你更喜欢", Pair("A. 用大家认可（常规的）的方式做", "B. 发明出自己的新方法")),
                Aka("6.当事先做好了计划，要在某个时间做某件事情，你会", Pair("A.  很高兴事先做好了相应的计划", "B. 因为被束缚而感到有些不愉快"))
            )

        val result: List<Aka>
            get() = listOf(
                Aka("ISTJ", Pair("1.嚴肅、安靜、藉由集中心志與全力投入，及可被信賴獲致成功。\n" +
                        "\n" +
                        "2.行事務實、有序、實際、邏輯、真實及可信賴\n" +
                        "\n" +
                        "3.十分留意且樂於任何事（工作、居家、生活均有良好組織及有序。）\n" +
                        "\n" +
                        "4.負責任。\n" +
                        "\n" +
                        "5.照設定成效來作出決策且不畏阻撓與閒言，會堅定為之。\n" +
                        "\n" +
                        "6.重視傳統與忠誠。\n" +
                        "\n" +
                        "7.傳統性的思考者或經理。", "")),
                Aka("ISFJ", Pair("1.安靜、和善、負責任且有良心。\n" +
                        "\n" +
                        "2.行事盡責投入。\n" +
                        "\n" +
                        "3.安定性高，常居項目工作或團體之安定力量。\n" +
                        "\n" +
                        "4.願投入、吃苦及力求精確。\n" +
                        "\n" +
                        "5.興趣通常不在於科技方面，對細節有耐心。\n" +
                        "\n" +
                        "6.忠誠、考慮周到、知性且會關切他人感受。\n" +
                        "\n" +
                        "7.致力於創構有序及和諧的工作與家庭環境。", "B. 现实的人")),
                Aka("INFJ", Pair("\n" +
                        "1.因為堅忍、創意及必須達成的意圖而能成功。\n" +
                        "\n" +
                        "2.會在工作中投注最大的努力。\n" +
                        "\n" +
                        "3.默默強力的、誠摯的及用心的關切他人。\n" +
                        "\n" +
                        "4.因堅守原則而受敬重。\n" +
                        "\n" +
                        "5.提出造福大眾利益的明確遠景而為人所尊敬與追隨。\n" +
                        "\n" +
                        "6.追求創見、關係及物質財物的意義及關聯。\n" +
                        "\n" +
                        "7.想瞭解甚麼能激勵別人及對他人具洞察力。\n" +
                        "\n" +
                        "8.光明正大且堅信其價值觀。\n" +
                        "\n" +
                        "9.有組織且果斷地履行其願景。", "")),
                Aka("ESTP", Pair("1.擅長現場實時解決問題—解決問題者。\n" +
                        "\n" +
                        "2.喜歡辦事並樂於其中及過程。\n" +
                        "\n" +
                        "3.傾向於喜好技術事務及運動，交結同好友人。\n" +
                        "\n" +
                        "4.具適應性、容忍度、務實性；投註心力於會很快具　成效工作。\n" +
                        "\n" +
                        "5.不喜歡冗長概念的解釋及理論。\n" +
                        "\n" +
                        "6.最專精於可操作、處理、分解或組合的真實事務。", "B. 分析存在的问题并攻破未解决的问题")),
                Aka("ESTJ", Pair("1.務實、真實、事實傾向，具企業或技術天份。\n" +
                        "\n" +
                        "2.不喜歡抽象理論；最喜歡學習可立即運用事理。\n" +
                        "\n" +
                        "3.喜好組織與管理活動且專註以最有效率方式行事以達致成效。\n" +
                        "\n" +
                        "4.具決斷力、關註細節且很快作出決策—優秀行政者。\n" +
                        "\n" +
                        "5.會忽略他人感受。\n" +
                        "\n" +
                        "6.喜作領導者或企業主管。", "B. 发明出自己的新方法")),
                Aka("ISTP", Pair("1.冷靜旁觀者—安靜、預留餘地、彈性及會以無偏見的好奇心與未預期原始的幽默觀察與分析。\n" +
                        "\n" +
                        "2.有興趣於探索原因及效果，技術事件是為何及如何運作且使用邏輯的原理組構事實、重視效能。\n" +
                        "\n" +
                        "3.擅長於掌握問題核心及找出解決方式。\n" +
                        "\n" +
                        "4.分析成事的緣由且能實時由大量資料中找出實際問題的核心。" , "B. 因为被束缚而感到有些不愉快"))
            )
    }

}